{
  "heroSection": {
    "hi": "Hi, I'm",
    "scroll": "Scroll",
    "checkMyWork": "Check my Work!",
    "phrases": [
      "Forever learning, always building. This is where my journey as a developer begins.",
      "Building both sides of the web one backend route and one frontend component at a time.",
      "Learning to build the professional webs, to become better.",
      "Still a learner, but already solving problems from backend to frontend.",
      "Self-taught, still in progress but already building what I used to only imagine.",
      "Learning to think full stack, falling in love with Node, React and Deploy along the way."
    ]
  },
  "about": {
    "about": "About",
    "me": "Me",
    "download": "Download my CV",
    "touch": "Get in touch",
    "title": "Passionate developer building functional, clean and modern web apps",
    "1paragraph": "With experience in both backend and frontend development, I enjoy turning complex problems into simple, scalable solutions. From designing RESTful APIs with Node.js and Express to creating elegant interfaces with React and TailwindCSS, I strive to build products that are fast, accessible, and user-friendly.",
    "2paragraph": "I'm passionate about continuous learning, collaboration, and delivering high-quality code. Currently focused on mastering advanced JavaScript, full-stack architecture, and deployment on cloud platforms like AWS or using tools like Vercel. I love what I do and I’m always looking for new challenges to grow as a developer."
  },
  "services": {
    "webDevTitle": "Web Development",
    "webDevDesc": "Creating modern websites and web apps using modern tools",
    "uiuxTitle": "UI/UX",
    "uiuxDesc": "Designing intuitive and inclusive user experiences focused on usability and clarity",
    "teamTitle": "Team Collaboration",
    "teamDesc": "Working in agile teams, applying Git and GitHub for efficient collaboration"
  },
  "navbar": {
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "skillsSection": {
    "my": "My",
    "skills": "Skills",
    "categories": {
      "all": "All",
      "fullstack": "Fullstack",
      "backend": "Backend",
      "frontend": "Frontend",
      "tools": "Tools",
      "devops": "DevOps"
    }
  },
  "projectSection": {
    "projects": {
      "bananaPeels": {
        "title": "BananaPeels, buy or sell your furniture.",
        "description": "BananaPeels is a second-hand marketplace web platform where users can securely post, browse, and manage ads quickly and easily."
      },
      "men-api-scaffold": {
        "title": "NPM package",
        "description": "A lightweight and functional scaffold for building APIs using the MEN architecture (MongoDB - Express - Node.js), designed for those who want to get started quickly with a clean and solid foundation. "
      },
      "calculator": {
        "title": "Calculator",
        "description": "It is a mini project in order to practicing vanilla JS and HTML/CSS"
      }
    },
    "chekGit": "All my projects in ",
    "whiteTitle": "Featured",
    "purpleTitle": "Projects",
    "intro": "A glimpse into the work. I'm most proud of creative solutions, real-world challenges, and clean code.",
    "have": "Have a look the projects below."
  },
  "contactSection": {
    "titleWhite": "Get In",
    "titlePrimary": "Touch",
    "intro": "Feel free to contact me what ever you need! I am open to work or discuss new opportunities.",
    "connect": "Connect with me!",
    "email": "Email",
    "phone": "Phone number",
    "location": "Location",
    "locationValue": "Jaén, Spain",
    "contactMe": "Contact me",
    "sendMessage": "Send a Message",
    "yourName": "Your Name",
    "yourEmail": "Your Email",
    "yourMessage": "Your Message",
    "sending": "Sending...",
    "send": "Send",
    "toastTitle": "Message sent successfully!",
    "toastDescription": "Thanks for your message! I will reply ASAP"
  }
}