{
  "heroSection": {
    "hi": "Hola, soy",
    "scroll": "Desliza",
    "checkMyWork": "Echa un vistazo a mis trabajos!",
    "phrases": [
      "Aprendiendo siempre, construyendo sin parar. Aquí comienza mi camino como desarrollador.",
      "Construyendo ambos lados de la web, una ruta backend y un componente frontend a la vez.",
      "Aprendiendo a construir webs profesionales para ser mejor.",
      "Todavía aprendiendo, pero ya resolviendo problemas de backend a frontend.",
      "Autodidacta, aún en progreso pero ya construyendo lo que antes solo imaginaba.",
      "Pensando en full stack, enamorándome de Node, React y el Deploy en el camino."
    ]
  },
  "about": {
    "about": "Sobre",
    "me": "Mi",
    "download": "Descarga mi CV",
    "touch": "Contacto",
    "title": "Apasionado por crear aplicaciones web funcionales, limpias y modernas",
    "1paragraph": "  Con experiencia tanto en el desarrollo backend como frontend, disfruto convertir problemas complejos en soluciones simples y escalables. Desde diseñar APIs RESTful con Node.js y Express hasta construir interfaces elegantes con React y TailwindCSS, me esfuerzo por crear productos rápidos, accesibles y fáciles de usar.",
    "2paragraph": "  Me apasiona el aprendizaje continuo, el trabajo en equipo y la entrega de código de alta calidad. Actualmente estoy enfocado en perfeccionar mis conocimientos en JavaScript avanzado, arquitectura full-stack y despliegue en plataformas en la nube como AWS. Amo lo que hago y siempre busco nuevos retos para seguir creciendo como desarrollador."
  },
  "services": {
    "webDevTitle": "Desarrollo Web",
    "webDevDesc": "Creación de sitios y aplicaciones web modernas usando herramientas actuales",
    "uiuxTitle": "UI/UX",
    "uiuxDesc": "Diseño de experiencias intuitivas e inclusivas centradas en la usabilidad y la claridad",
    "teamTitle": "Colaboración en Equipo",
    "teamDesc": "Trabajo en equipos ágiles, aplicando Git y GitHub para colaborar eficientemente"
  },
  "navbar": {
    "home": "Inicio",
    "about": "Sobre mí",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "skillsSection": {
    "my": "Mis",
    "skills": "Habilidades",
    "categories": {
      "all": "Todas",
      "fullstack": "Fullstack",
      "backend": "Backend",
      "frontend": "Frontend",
      "tools": "Herramientas",
      "devops": "DevOps"
    }
  },
  "projectSection": {
    "projects": {
      "bananaPeels": {
        "title": "BananaPeels, compra o vende tus muebles.",
        "description": "BananaPeels es una plataforma web de compraventa de segunda mano donde los usuarios pueden publicar, explorar y gestionar anuncios de forma segura, rápida y sencilla."
      },
      "men-api-scaffold": {
        "title": "Paquete NPM",
        "description": "Un scaffold ligero y funcional para crear APIs con la arquitectura MEN (MongoDB - Express - Node.js) pensado para quienes quieren empezar rápido, con una base sólida y limpia."
      },
      "TalentScope (Back-end)": {
        "title": "TalentScope (Back-end)",
        "description": "TalentScope es una plataforma backend diseñada para importar, normalizar y exponer ofertas de trabajo mediante una arquitectura modular basada en microservicios."
      },
      "ScrapComponentes": {
        "title": "ScrapComponentes",
        "description": "Scrapccomponentes es un proyecto de código abierto que rastrea los precios de los productos de PCComponentes.com en tiempo real."
      }
    },
    "chekGit": "Todos mis proyectos en",
    "whiteTitle": "Proyectos",
    "purpleTitle": "Destacados",
    "intro": "Echa un vistazo a mis trabajos. Me enorgullezco especialmente de las soluciones creativas, los desafíos del mundo real y el código limpio.",
    "have": "Echa un ojo a mis proyectos aqui abajo"
  },
  "contactSection": {
    "titleWhite": "Ponte en",
    "titlePrimary": "Contacto",
    "intro": "No dudes en escribirme para lo que necesites. Estoy abierto a trabajar o hablar sobre nuevas oportunidades.",
    "connect": "¡Conecta conmigo!",
    "email": "Correo electrónico",
    "phone": "Número de teléfono",
    "location": "Ubicación",
    "locationValue": "Jaén, España",
    "contactMe": "Contáctame",
    "sendMessage": "Enviar un mensaje",
    "yourName": "Tu nombre",
    "yourEmail": "Tu correo",
    "yourMessage": "Tu mensaje",
    "sending": "Enviando...",
    "send": "Enviar",
    "toastTitle": "¡Mensaje enviado correctamente!",
    "toastDescription": "Gracias por tu mensaje. Te responderé lo antes posible."
  }
}















